src/main/java/co/gov/colpensiones/services/consultaestadotramite/SOAPServiceBinding.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<wsdl:definitions name="ConsultaEstadoTramite" targetNamespace="http://www.colpensiones.gov.co/services/ConsultaEstadoTramite" xmlns:soapenc11="http://schemas.xmlsoap.org/soap/encoding/" xmlns:tns0="http://www.colpensiones.gov.co/portal/common/WebServices/WSSE/RequestSystem" xmlns:bwh="http://www.tibco.com/8b53c8b2ace746248418b65a9d312897/SOAPServiceBinding" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:mime="http://schemas.xmlsoap.org/wsdl/mime/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://www.colpensiones.gov.co/services/ConsultaEstadoTramite" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:soap11="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns3="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:tns1="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:tns2="http://www.colpensiones.gov.co/schemas/ConsultaEstadoTramite">
  <wsdl:types>
    <xsd:schema elementFormDefault="qualified" targetNamespace="http://www.colpensiones.gov.co/portal/common/WebServices/WSSE/RequestSystem" xmlns:tns="http://www.colpensiones.gov.co/portal/common/WebServices/WSSE/RequestSystem" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><xsd:complexType name="System"><xsd:sequence><xsd:element minOccurs="0" name="InputSystem" type="xsd:string"/><xsd:element minOccurs="0" name="ApplicationID" type="xsd:string"/><xsd:element name="TransactionID" type="xsd:string"/><xsd:element minOccurs="0" name="IP" type="xsd:string"/></xsd:sequence></xsd:complexType><xsd:element name="System" type="tns:System"/></xsd:schema>
    <xsd:schema attributeFormDefault="unqualified" elementFormDefault="qualified" targetNamespace="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:tns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><xsd:attribute name="Id" type="xsd:ID"><xsd:annotation/></xsd:attribute><xsd:attributeGroup name="commonAtts"><xsd:annotation/><xsd:attribute ref="tns:Id"/><xsd:anyAttribute namespace="##other" processContents="lax"/></xsd:attributeGroup><xsd:complexType name="AttributedDateTime"><xsd:annotation/><xsd:simpleContent><xsd:extension base="xsd:string"><xsd:attributeGroup ref="tns:commonAtts"/></xsd:extension></xsd:simpleContent></xsd:complexType><xsd:complexType name="AttributedURI"><xsd:annotation/><xsd:simpleContent><xsd:extension base="xsd:anyURI"><xsd:attributeGroup ref="tns:commonAtts"/></xsd:extension></xsd:simpleContent></xsd:complexType><xsd:complexType name="TimestampType"><xsd:annotation/><xsd:sequence><xsd:element minOccurs="0" ref="tns:Created"/><xsd:element minOccurs="0" ref="tns:Expires"/><xsd:choice maxOccurs="unbounded" minOccurs="0"><xsd:any namespace="##other" processContents="lax"/></xsd:choice></xsd:sequence><xsd:attributeGroup ref="tns:commonAtts"/></xsd:complexType><xsd:element name="Timestamp" type="tns:TimestampType"><xsd:annotation/></xsd:element><xsd:element name="Expires" type="tns:AttributedDateTime"><xsd:annotation/></xsd:element><xsd:element name="Created" type="tns:AttributedDateTime"><xsd:annotation/></xsd:element></xsd:schema>
    <xsd:schema targetNamespace="http://www.colpensiones.gov.co/services/ConsultaEstadoTramite" xmlns="http://www.colpensiones.gov.co/services/ConsultaEstadoTramite" xmlns:tns="http://www.colpensiones.gov.co/portal/common/WebServices/WSSE/RequestSystem" xmlns:tns0="http://www.colpensiones.gov.co/schemas/ConsultaEstadoTramite" xmlns:tns1="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><xsd:import namespace="http://www.colpensiones.gov.co/portal/common/WebServices/WSSE/RequestSystem"/><xsd:import namespace="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"/><xsd:import namespace="http://www.colpensiones.gov.co/schemas/ConsultaEstadoTramite"/></xsd:schema>
    <xsd:schema elementFormDefault="qualified" targetNamespace="http://www.colpensiones.gov.co/schemas/ConsultaEstadoTramite" xmlns:tns="http://www.colpensiones.gov.co/schemas/ConsultaEstadoTramite" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><xsd:element name="ConsultaEstadoTramiteRequest"><xsd:complexType><xsd:sequence><xsd:element name="Radicado"><xsd:simpleType><xsd:restriction base="xsd:string"><xsd:minLength value="0"/><xsd:maxLength value="25"/></xsd:restriction></xsd:simpleType></xsd:element><xsd:element name="TipoDocumento"><xsd:simpleType><xsd:restriction base="xsd:string"><xsd:minLength value="0"/><xsd:maxLength value="25"/></xsd:restriction></xsd:simpleType></xsd:element><xsd:element name="Documento"><xsd:simpleType><xsd:restriction base="xsd:string"><xsd:minLength value="0"/><xsd:maxLength value="25"/></xsd:restriction></xsd:simpleType></xsd:element></xsd:sequence></xsd:complexType></xsd:element><xsd:element name="ConsultaEstadoTramiteResponse"><xsd:complexType><xsd:sequence><xsd:element minOccurs="0" name="Estado"><xsd:complexType><xsd:sequence><xsd:element name="Codigo" type="xsd:string"/><xsd:element name="Descripcion" type="xsd:string"/></xsd:sequence></xsd:complexType></xsd:element><xsd:element minOccurs="0" name="Tramite"><xsd:complexType><xsd:sequence><xsd:element minOccurs="0" name="Codigo" type="xsd:string"/><xsd:element minOccurs="0" name="Nombre" type="xsd:string"/><xsd:element minOccurs="0" name="CodSubtramite" type="xsd:string"/><xsd:element minOccurs="0" name="NomSubtramite" type="xsd:string"/></xsd:sequence></xsd:complexType></xsd:element><xsd:element minOccurs="0" name="FechaEstado" type="xsd:string"/><xsd:element maxOccurs="1" minOccurs="0" name="NumeroRadicado" type="xsd:string"/><xsd:element maxOccurs="1" minOccurs="0" name="FechaRadicacion" type="xsd:string"/><xsd:element maxOccurs="1" minOccurs="0" name="CodigoEstadoEspecifico" type="xsd:string"/><xsd:element maxOccurs="1" minOccurs="0" name="NombreEstadoEspecifico" type="xsd:string"/><xsd:element maxOccurs="1" minOccurs="0" name="EstadoHomologado"><xsd:complexType><xsd:sequence><xsd:element minOccurs="0" name="Nombre" type="xsd:string"/><xsd:element minOccurs="0" name="Descripcion" type="xsd:string"/><xsd:element minOccurs="0" name="Codigo" type="xsd:string"/></xsd:sequence></xsd:complexType></xsd:element><xsd:element maxOccurs="1" minOccurs="0" name="Tiempos"><xsd:complexType><xsd:sequence><xsd:element minOccurs="0" name="TiempoLimiteRespuesta" type="xsd:string"/><xsd:element minOccurs="0" name="TipoTiempoLimite" type="xsd:string"/><xsd:element minOccurs="0" name="FechaLimiteRespuesta" type="xsd:string"/></xsd:sequence></xsd:complexType></xsd:element><xsd:element maxOccurs="1" minOccurs="0" name="Error"><xsd:complexType><xsd:sequence><xsd:element minOccurs="0" name="Codigo" type="xsd:string"/><xsd:element minOccurs="0" name="Descripcion" type="xsd:string"/></xsd:sequence></xsd:complexType></xsd:element></xsd:sequence></xsd:complexType></xsd:element></xsd:schema>
    <xsd:schema attributeFormDefault="unqualified" elementFormDefault="qualified" targetNamespace="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:tns="http://www.w3.org/2000/09/xmldsig#" xmlns:tns0="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:tns1="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:tns2="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><xsd:import namespace="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"/><xsd:complexType name="AttributedString"><xsd:annotation/><xsd:simpleContent><xsd:extension base="xsd:string"><xsd:attribute ref="tns0:Id"/><xsd:anyAttribute namespace="##other" processContents="lax"/></xsd:extension></xsd:simpleContent></xsd:complexType><xsd:complexType name="PasswordString"><xsd:annotation/><xsd:simpleContent><xsd:extension base="tns1:AttributedString"><xsd:attribute form="unqualified" name="Type" type="xsd:anyURI"/></xsd:extension></xsd:simpleContent></xsd:complexType><xsd:complexType name="EncodedString"><xsd:annotation/><xsd:simpleContent><xsd:extension base="tns1:AttributedString"><xsd:attribute form="unqualified" name="EncodingType" type="xsd:anyURI"/></xsd:extension></xsd:simpleContent></xsd:complexType><xsd:complexType name="UsernameTokenType"><xsd:annotation/><xsd:sequence><xsd:element name="Username" type="tns1:AttributedString"/><xsd:any maxOccurs="unbounded" minOccurs="0" namespace="##any" processContents="lax"/></xsd:sequence><xsd:attribute ref="tns0:Id"/><xsd:anyAttribute namespace="##other" processContents="lax"/></xsd:complexType><xsd:complexType name="BinarySecurityTokenType"><xsd:annotation/><xsd:simpleContent><xsd:extension base="tns1:EncodedString"><xsd:attribute form="unqualified" name="ValueType" type="xsd:anyURI"/></xsd:extension></xsd:simpleContent></xsd:complexType><xsd:complexType name="KeyIdentifierType"><xsd:annotation/><xsd:simpleContent><xsd:extension base="tns1:EncodedString"><xsd:attribute form="unqualified" name="ValueType" type="xsd:anyURI"/></xsd:extension></xsd:simpleContent></xsd:complexType><xsd:simpleType name="tUsage"><xsd:annotation/><xsd:list itemType="xsd:anyURI"/></xsd:simpleType><xsd:attribute name="Usage" type="tns1:tUsage"><xsd:annotation/></xsd:attribute><xsd:complexType name="ReferenceType"><xsd:annotation/><xsd:attribute form="unqualified" name="URI" type="xsd:anyURI"/><xsd:attribute form="unqualified" name="ValueType" type="xsd:anyURI"/><xsd:anyAttribute namespace="##other" processContents="lax"/></xsd:complexType><xsd:complexType name="EmbeddedType"><xsd:annotation/><xsd:choice maxOccurs="unbounded" minOccurs="0"><xsd:any namespace="##any" processContents="lax"/></xsd:choice><xsd:attribute form="unqualified" name="ValueType" type="xsd:anyURI"/><xsd:anyAttribute namespace="##other" processContents="lax"/></xsd:complexType><xsd:complexType name="SecurityTokenReferenceType"><xsd:annotation/><xsd:choice maxOccurs="unbounded" minOccurs="0"><xsd:any namespace="##any" processContents="lax"/></xsd:choice><xsd:attribute ref="tns0:Id"/><xsd:attribute ref="tns1:Usage"/><xsd:anyAttribute namespace="##other" processContents="lax"/></xsd:complexType><xsd:complexType name="SecurityHeaderType"><xsd:annotation/><xsd:sequence><xsd:any maxOccurs="unbounded" minOccurs="0" namespace="##any" processContents="lax"/></xsd:sequence><xsd:anyAttribute namespace="##other" processContents="lax"/></xsd:complexType><xsd:complexType name="TransformationParametersType"><xsd:annotation/><xsd:sequence><xsd:any maxOccurs="unbounded" minOccurs="0" namespace="##any" processContents="lax"/></xsd:sequence><xsd:anyAttribute namespace="##other" processContents="lax"/></xsd:complexType><xsd:element name="UsernameToken" type="tns1:UsernameTokenType"><xsd:annotation/></xsd:element><xsd:element name="BinarySecurityToken" type="tns1:BinarySecurityTokenType"><xsd:annotation/></xsd:element><xsd:element name="Reference" type="tns1:ReferenceType"><xsd:annotation/></xsd:element><xsd:element name="Embedded" type="tns1:EmbeddedType"><xsd:annotation/></xsd:element><xsd:element name="KeyIdentifier" type="tns1:KeyIdentifierType"><xsd:annotation/></xsd:element><xsd:element name="SecurityTokenReference" type="tns1:SecurityTokenReferenceType"><xsd:annotation/></xsd:element><xsd:element name="Security" type="tns1:SecurityHeaderType"><xsd:annotation/></xsd:element><xsd:element name="TransformationParameters" type="tns1:TransformationParametersType"><xsd:annotation/></xsd:element><xsd:element name="Password" type="tns1:PasswordString"/><xsd:element name="Nonce" type="tns1:EncodedString"/></xsd:schema>
  </wsdl:types>
  <wsdl:message name="Security">
    <wsdl:part name="parameters" element="tns3:Security">
    </wsdl:part>
  </wsdl:message>
  <wsdl:message name="System">
    <wsdl:part name="parameters" element="tns0:System">
    </wsdl:part>
  </wsdl:message>
  <wsdl:message name="EstadoTramiteRequest">
    <wsdl:part name="parameters" element="tns2:ConsultaEstadoTramiteRequest">
    </wsdl:part>
  </wsdl:message>
  <wsdl:message name="EstadoTramiteResponse">
    <wsdl:part name="parameters" element="tns2:ConsultaEstadoTramiteResponse">
    </wsdl:part>
  </wsdl:message>
  <wsdl:portType name="ConsultaEstadoTramite">
    <wsdl:operation name="EstadoTramite">
      <wsdl:input message="tns:EstadoTramiteRequest">
    </wsdl:input>
      <wsdl:output message="tns:EstadoTramiteResponse">
    </wsdl:output>
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="SOAPServiceBinding" type="tns:ConsultaEstadoTramite">
    <soap11:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
    <wsdl:operation name="EstadoTramite">
      <soap11:operation soapAction="EstadoTramite" style="document" wsdl:required="true"/>
      <wsdl:input>
        <soap11:body parts="parameters" use="literal"/>
        <soap11:header message="tns:Security" part="parameters" use="literal">
        </soap11:header>
        <soap11:header message="tns:System" part="parameters" use="literal">
        </soap11:header>
      </wsdl:input>
      <wsdl:output>
        <soap11:body parts="parameters" use="literal"/>
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="ConsultaEstadoTramite">
    <wsdl:port name="ConsultaEstadoTramitePort" binding="tns:SOAPServiceBinding">
      <soap11:address location=" http://10.130.70.126:13040/Colpensiones/Services/ConsultaEstadoTramite"/>
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>
